from gtts import gTTS
import pygame

text = """પોઝિટિવ- આજે કોઈ શુભ સમાચાર મળવાથી ચિંતા દૂર થશે. છેલ્લા કેટલાક સમયથી ચાલી રહેલી ભાગદોડમાંથી પણ રાહત મળશે. તમે તમારી વિચારસરણી અને બુદ્ધિશક્તિથી દરેક સમસ્યાનો ઉકેલ મેળવવામાં સક્ષમ રહેશો. કોઈ સંત કે તમારા ગુરુના સાનિધ્યમાં રહેવું તમને માનસિક શાંતિ પ્રદાન કરશે.

નેગેટિવ- પ્રેક્ટિકલ બનો, કારણ કે કેટલાક લોકો સ્વાર્થ સાધવા માટે તમારો ઉપયોગ કરશે. મહિલા વર્ગ પોતાના સાસરી પક્ષ સાથે સંબંધ મધુર બનાવી રાખે. ક્યારેક તમારા ગુસ્સા અને ખોટા શબ્દોનો પ્રયોગ સંબંધો બગાડી પણ શકે છે.

વ્યવસાય- વેપારમાં કંઈક નવું કામ શરૂ કરવાનું આયોજન કરી શકો છો. જોકે, પડકારો અને મુશ્કેલીઓ ચાલુ રહેશે. નાના ઉદ્યોગવાળા લોકોને આજે સારો નફો થશે. કર્મચારીઓની સલાહ પર પણ ચોક્કસ ધ્યાન આપો, તમને કોઈ યોગ્ય ઉકેલ મળી શકે છે.

લવ- પરિવારના સભ્યો સાથે મનોરંજન તથા ડિનર વગેરે માટે સમય પસાર કરવો પરસ્પર સંબંધોને મધુર બનાવશે. પ્રેમ સંબંધોમાં મધુરતા વધશે.

સ્વાસ્થ્ય- છેલ્લા કેટલાક સમયથી ચાલી રહેલી સ્વાસ્થ્ય સંબંધિત પરેશાનીમાં સુધારો આવશે. તમે તમારી જાતને સંપૂર્ણ સ્વસ્થ અનુભવશો.

લકી કલર- બદામી

લકી નંબર- 3"""

tts = gTTS(text=text, lang='gu')
tts.save("voice.mp3")

pygame.init()
pygame.mixer.init()

#music load
pygame.mixer.music.load("voice.mp3")
#music play 
pygame.mixer.music.play()

input("Press enter to continue")